Repository: xcv58/MacTools
Catalog: Plugins/ActivityBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# component.ai.activeSessions
source: %d 个活动会话
ar: %d الجلسات النشطة
de: %d aktive Sitzungen
en: %d active sessions
es: %d sesiones activas
fr: %d sessions actives
ja: %d アクティブなセッション
ko: %d 활성 세션
pt: %d sessões ativas
ru: %d активных сессий
tr: %d etkin oturum
zh_hant: %d 個活動會話

# component.ai.dailyAverage.above
source: 比日均高 %d%%（%@）
ar: %d%% أعلى من المتوسط اليومي (%@)
de: %d%% über Ihrem Tagesdurchschnitt (%@)
en: %d%% above your daily average (%@)
es: %d%% por encima de tu promedio diario (%@)
fr: %d%% au-dessus de votre moyenne quotidienne (%@)
ja: %d%% 日平均 (%@) を上回る
ko: 일일 평균보다 높은 %d%%(%@)
pt: %d%% acima da sua média diária (%@)
ru: %d%% выше среднего дневного значения (%@)
tr: Günlük ortalamanızdan %d%% yüksek (%@)

# component.ai.dailyAverage.below
source: 比日均低 %d%%（%@）
ar: %d%% أقل من المتوسط اليومي (%@)
de: %d%% unter Ihrem Tagesdurchschnitt (%@)
en: %d%% below your daily average (%@)
es: %d%% por debajo de tu promedio diario (%@)
fr: %d%% en dessous de votre moyenne quotidienne (%@)
ja: %d%% は 1 日の平均値 (%@) を下回ります
ko: 일일 평균보다 낮은 %d%%(%@)
pt: %d%% abaixo da sua média diária (%@)
ru: %d%% ниже среднего дневного значения (%@)
tr: Günlük ortalamanızdan %d%% düşük (%@)

# component.ai.dailyAverage.same
source: 与日均持平（%@）
ar: مساويًا لمتوسطك اليومي (%@)
de: Entspricht Ihrem Tagesdurchschnitt (%@)
en: On par with your daily average (%@)
es: A la par con tu promedio diario (%@)
fr: À égalité avec votre moyenne quotidienne (%@)
ja: 1 日の平均 (%@) と同等
ko: 일일 평균(%@)과 동일
pt: No mesmo nível da sua média diária (%@)
ru: На уровне среднего показателя за день (%@)
tr: Günlük ortalamanızla aynı (%@)
zh_hant: 與日均持平（%@）

# component.ai.detail
source: %@ 字 · %@ 次工具调用
ar: %@ كلمة · %@ استدعاءات الأداة
de: %@ Wörter · %@ Toolaufrufe
en: %@ words · %@ tool calls
es: %@ palabras · %@ llamadas a herramientas
fr: %@ mots · %@ appels d'outils
ja: %@ ワード · %@ ツール呼び出し
ko: %@ 단어 · %@ 도구 호출
pt: %@ palavras · %@ chamadas de ferramentas
ru: %@ слов · %@ вызовов инструментов
tr: %@ sözcük · %@ araç çağrısı
zh_hant: %@ 字 · %@ 次工具調用

# component.ai.title
source: AI 工作时长
ar: وقت عمل الذكاء الاصطناعي
de: KI-Arbeitszeit
en: AI Work Time
es: Tiempo de trabajo de IA
fr: Temps de travail de l'IA
ja: AI の作業時間
ko: AI 작업시간
pt: Tempo de trabalho da IA
ru: Время работы ИИ
tr: Yapay Zekâ Çalışma Süresi
zh_hant: AI 工作時長

# component.chart.emptyCoding
source: 暂无编程活动
ar: لا يوجد نشاط ترميزي
de: Keine Codierungsaktivität
en: No coding activity
es: Sin actividad de codificación
fr: Aucune activité de codage
ja: コーディング作業はありません
ko: 코딩 활동 없음
pt: Nenhuma atividade de codificação
ru: Нет кодирования
tr: Kodlama etkinliği yok
zh_hant: 暫無編程活動

# component.chart.emptyInput
source: 暂无输入活动
ar: لا يوجد نشاط إدخال
de: Keine Eingabeaktivität
en: No input activity
es: Sin actividad de entrada
fr: Aucune activité de saisie
ja: 入力アクティビティがありません
ko: 입력 활동 없음
pt: Nenhuma atividade de entrada
ru: Нет активности ввода
tr: Girdi etkinliği yok
zh_hant: 暫無輸入活動

# component.date.today
source: 今天
ar: اليوم
de: Heute
en: Today
es: Hoy
fr: Aujourd'hui
ja: 今日
ko: 오늘
pt: Hoje
ru: Сегодня
tr: Bugün

# component.date.yesterday
source: 昨天
ar: أمس
de: Gestern
en: Yesterday
es: Ayer
fr: Hier
ja: 昨日
ko: 어제
pt: Ontem
ru: Вчера
tr: Dün

# component.footer.close
source: 关闭
ar: إغلاق
de: Schließen
en: Close
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть
tr: Kapat
zh_hant: 關閉

# component.footer.hooks
source: Hook
ar: خطافات
de: Haken
en: Hooks
es: Ganchos
fr: Crochets
ja: フック
ko: 후크
pt: Ganchos
ru: Крючки
tr: Hook'lar

# component.footer.permissions
source: 权限
ar: الأذونات
de: Berechtigungen
en: Permissions
es: Permisos
fr: Autorisations
ja: 権限
ko: 권한
pt: Permissões
ru: Разрешения
tr: İzinler
zh_hant: 權限

# component.funFact.clickMinutes
source: 你今天点击了 %@ 次，约等于敲桌子 %d 分钟。
ar: لقد قمت بالنقر فوق %@ مرة. وهذا يشبه النقر على مكتبك لمدة %d دقيقة تقريبًا.
de: Sie haben %@ Mal geklickt. Das ist so, als würden Sie etwa %d Minuten lang auf Ihren Schreibtisch klopfen.
en: You clicked %@ times. That's like tapping your desk for about %d minutes.
es: Hiciste clic %@ veces. Eso es como tocar tu escritorio durante aproximadamente %d minutos.
fr: Vous avez cliqué %@ fois. C'est comme si vous tapotiez votre bureau pendant environ %d minutes.
ja: %@ 回クリックしました。これは、約 %d 分間机をたたくことに似ています。
ko: %@번 클릭하셨습니다. 이는 약 %d분 동안 책상을 두드리는 것과 같습니다.
pt: Você clicou %@ vezes. Isso é como bater na sua mesa por cerca de %d minutos.
ru: Вы нажали %@ раз. Это все равно, что стучать по столу примерно %d минут.
tr: %@ kez tıkladınız. Bu, masanızı yaklaşık %d dakika tıklamaya bedel.
zh_hant: 你今天點擊了 %@ 次，約等於敲桌子 %d 分鐘。

# component.funFact.typedPages
source: 你今天敲了 %@ 次键盘，约等于写满 %d 页。
ar: لقد أجريت %@ ضغطات على المفاتيح اليوم. يتعلق الأمر بكتابة %d صفحة كاملة.
de: Sie haben heute %@ Tastenanschläge gemacht. Das bedeutet, dass %d ganze Seiten geschrieben werden.
en: You made %@ keystrokes today. That's about writing %d full pages.
es: Hoy hiciste %@ pulsaciones de teclas. Se trata de escribir %d páginas completas.
fr: Vous avez effectué %@ frappes au clavier aujourd'hui. Il s'agit d'écrire %d pages complètes.
ja: 今日、%@ 回のキーストロークを行いました。つまり、%d ページ全体を書くことになります。
ko: 오늘 %@ 키를 누르셨습니다. 그것은 %d 전체 페이지를 작성하는 것과 같습니다.
pt: Você pressionou %@ hoje. Trata-se de escrever %d páginas inteiras.
ru: Сегодня вы нажали %@ клавиш. Речь идет о написании %d полных страниц.
tr: Bugün %@ tuş vuruşu yaptınız. Bu, yaklaşık %d tam sayfa yazmaya denk geliyor.
zh_hant: 你今天敲了 %@ 次鍵盤，約等於寫滿 %d 頁。

# component.inputInsight.enableTracking
source: 授权输入监控并开启后即可开始记录本地统计。
ar: امنح مراقبة الإدخال وقم بتشغيلها لبدء جمع الإحصائيات المحلية.
de: Gewähren Sie die Eingabeüberwachung und aktivieren Sie diese, um mit der Erfassung lokaler Statistiken zu beginnen.
en: Grant Input Monitoring and turn this on to start collecting local stats.
es: Otorgue monitoreo de entrada y actívelo para comenzar a recopilar estadísticas locales.
fr: Accordez la surveillance des entrées et activez-la pour commencer à collecter des statistiques locales.
ja: 入力モニタリングを許可し、これをオンにしてローカル統計の収集を開始します。
ko: 입력 모니터링을 부여하고 이 기능을 켜면 로컬 통계 수집이 시작됩니다.
pt: Conceda monitoramento de entrada e ative-o para começar a coletar estatísticas locais.
ru: Разрешите мониторинг ввода и включите его, чтобы начать сбор локальной статистики.
tr: Yerel istatistik toplamaya başlamak için Giriş İzleme izni verin ve bunu açın.
zh_hant: 授權輸入監控並開啟後即可開始記錄本地統計。

# component.legend.clicks
source: 点击
ar: النقرات
de: Klicks
en: Clicks
es: Clics
fr: Clics
ja: クリック
ko: 클릭수
pt: Cliques
ru: Клики
tr: Tıklama
zh_hant: 點擊

# component.legend.keys
source: 按键
ar: المفاتيح
de: Schlüssel
en: Keys
es: Claves
fr: Clés
ja: キー
ko: 키
pt: Chaves
ru: Ключи
tr: Tuş
zh_hant: 按鍵

# component.legend.scrolls
source: 滚动
ar: مخطوطات
de: Schriftrollen
en: Scrolls
es: Pergaminos
fr: Parchemins
ja: 巻物
ko: 스크롤
pt: Pergaminhos
ru: Свитки
tr: Kaydırma
zh_hant: 滾動

# component.metric.clicks
source: 点击
ar: النقرات
de: Klicks
en: Clicks
es: Clics
fr: Clics
ja: クリック数
ko: 클릭수
pt: Cliques
ru: Клики
tr: Tıklama
zh_hant: 點擊

# component.metric.keystrokes
source: 按键
ar: ضغطات المفاتيح
de: Tastenanschläge
en: Keystrokes
es: Pulsiones de teclas
fr: Frappes au clavier
ja: キーストローク
ko: 키 입력
pt: Pressionamentos de teclas
ru: Нажатия клавиш
tr: Tuş vuruşu
zh_hant: 按鍵

# component.metric.screenTime
source: 屏幕时间
ar: وقت النظر إلى الشاشة
de: Bildschirmzeit
en: Screen Time
es: Tiempo de pantalla
fr: Temps d'écran
ja: 上映時間
ko: 스크린 타임
pt: Tempo de uso
ru: Экранное время
tr: Ekran Süresi
zh_hant: 螢幕時間

# component.metric.scrolls
source: 滚动
ar: مخطوطات
de: Schriftrollen
en: Scrolls
es: Pergaminos
fr: Parchemins
ja: 巻物
ko: 스크롤
pt: Pergaminhos
ru: Свитки
tr: Kaydırma
zh_hant: 滾動

# component.screenTime.title
source: 屏幕时间
ar: وقت النظر إلى الشاشة
de: Bildschirmzeit
en: Screen Time
es: Tiempo de pantalla
fr: Temps d'écran
ja: 上映時間
ko: 스크린 타임
pt: Tempo de uso
ru: Экранное время
tr: Ekran Süresi
zh_hant: 螢幕時間

# component.title
source: 活动统计
ar: إحصائيات النشاط
de: Aktivitätsstatistiken
en: Activity Stats
es: Estadísticas de actividad
fr: Statistiques d'activité
ja: アクティビティ統計
ko: 활동 통계
pt: Estatísticas de atividade
ru: Статистика активности
tr: Etkinlik İstatistikleri
zh_hant: 活動統計

# component.topApps.empty
source: 暂无活动
ar: لا يوجد أي نشاط بعد
de: Noch keine Aktivität
en: No activity yet
es: Aún no hay actividad
fr: Aucune activité pour l'instant
ja: まだアクティビティはありません
ko: 아직 활동이 없습니다
pt: Nenhuma atividade ainda
ru: Пока никаких действий
tr: Henüz etkinlik yok
zh_hant: 暫無活動

# component.topApps.enableTracking
source: 开启统计后查看应用排行
ar: قم بتشغيل التتبع لرؤية تصنيفات التطبيقات
de: Aktivieren Sie das Tracking, um App-Rankings anzuzeigen
en: Turn on tracking to see app rankings
es: Activa el seguimiento para ver las clasificaciones de las aplicaciones
fr: Activez le suivi pour voir le classement des applications
ja: アプリのランキングを確認するにはトラッキングをオンにしてください
ko: 추적을 켜서 앱 순위를 확인하세요
pt: Ative o rastreamento para ver as classificações do aplicativo
ru: Включите отслеживание, чтобы увидеть рейтинг приложения
tr: Uygulama sıralamasını görmek için izlemeyi açın
zh_hant: 開啟統計後查看應用排行

# component.topApps.title
source: 屏幕时间最多的应用
ar: أفضل التطبيقات حسب مدة استخدام الجهاز
de: Top-Apps nach Bildschirmzeit
en: Top Apps by Screen Time
es: Aplicaciones principales por tiempo de pantalla
fr: Meilleures applications par temps d'écran
ja: スクリーンタイム別トップアプリ
ko: 기기 사용 시간별 인기 앱
pt: Principais aplicativos por tempo de uso
ru: Лучшие приложения по экранному времени
tr: Ekran Süresine Göre En Çok Kullanılan Uygulamalar
zh_hant: 螢幕時間最多的應用

# component.trendMode.codingTools
source: 编程工具
ar: أدوات الترميز
de: Codierungstools
en: Coding Tools
es: Herramientas de codificación
fr: Outils de codage
ja: コーディング ツール
ko: 코딩 도구
pt: Ferramentas de codificação
ru: Инструменты кодирования
tr: Kodlama Araçları
zh_hant: 編程工具

# component.trendMode.input
source: 输入
ar: الإدخال
de: Eingabe
en: Input
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt: Entrada
ru: Ввод
tr: Girdi
zh_hant: 輸入

# component.trends.title
source: 趋势
ar: الاتجاهات
de: Trends
en: Trends
es: Tendencias
fr: Tendances
ja: トレンド
ko: 트렌드
pt: Tendências
ru: Тенденции
tr: Eğilimler
zh_hant: 趨勢

# component.subtitle.aiListening
source: AI 监听中
ar: الاستماع للذكاء الاصطناعي
de: KI lauscht
en: AI listening
es: Escuchando IA
fr: Écoute IA
ja: AI 監視中
ko: AI 수신 중
pt: IA ouvindo
ru: ИИ слушает
tr: Yapay zekâ etkinliği dinleniyor
zh_hant: AI 監聽中

# component.subtitle.disabled
source: 未开启
ar: إيقاف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 未開啟

# component.subtitle.inputs
source: %@ 次输入
ar: %@ المدخلات
de: %@ Eingaben
en: %@ inputs
es: %@ entradas
fr: entrées %@
ja: %@ 入力
ko: %@ 입력
pt: %@ entradas
ru: %@ входы
tr: %@ girdi
zh_hant: %@ 次輸入

# error.hook.installFailed
source: Hook 安装失败：%@
ar: فشل تثبيت الخطاف: %@
de: Hook-Installation fehlgeschlagen: %@
en: Hook installation failed: %@
es: Error en la instalación del gancho: %@
fr: Échec de l'installation du hook : %@
ja: フックのインストールに失敗しました: %@
ko: 후크 설치 실패: %@
pt: Falha na instalação do gancho: %@
ru: Не удалось установить перехватчик: %@
tr: Hook yükleme başarısız: %@
zh_hant: Hook 安裝失敗：%@

# error.hook.uninstallFailed
source: Hook 卸载失败：%@
ar: فشل إلغاء تثبيت الخطافات: %@
de: Hooks konnten nicht deinstalliert werden: %@
en: Failed to uninstall Hooks: %@
es: No se pudieron desinstalar los hooks: %@
fr: Impossible de désinstaller les hooks : %@
ja: Hook をアンインストールできませんでした: %@
ko: Hook을 제거하지 못했습니다: %@
pt: Não foi possível desinstalar os hooks: %@
ru: Не удалось удалить хуки: %@
tr: Hook'lar kaldırılamadı: %@
zh_hant: Hook 解除安裝失敗：%@

# error.hook.invalidJSON
source: 无法解析配置文件：%@
ar: غير قادر على تحليل ملف التكوين: %@
de: Konfigurationsdatei konnte nicht geparst werden: %@
en: Unable to parse config file: %@
es: No se puede analizar el archivo de configuración: %@
fr: Impossible d'analyser le fichier de configuration : %@
ja: 構成ファイルを解析できません: %@
ko: 구성 파일을 구문 분석할 수 없습니다: %@
pt: Não foi possível analisar o arquivo de configuração: %@
ru: Невозможно проанализировать файл конфигурации: %@
tr: Yapılandırma dosyası çözümlenemedi: %@
zh_hant: 無法解析配置檔案：%@

# error.socket.bindFailed
source: 绑定 Socket 失败：%d
ar: فشل ربط المقبس: %d
de: Socket konnte nicht gebunden werden: %d
en: Failed to bind socket: %d
es: Error al vincular el socket: %d
fr: Échec de la liaison du socket : %d
ja: ソケットのバインドに失敗しました: %d
ko: 소켓 바인딩 실패: %d
pt: Falha ao vincular o soquete: %d
ru: Не удалось привязать сокет: %d
tr: Soket bağlama başarısız: %d
zh_hant: 綁定 Socket 失敗：%d

# error.socket.createFailed
source: 创建 Socket 失败：%d
ar: فشل في إنشاء مأخذ التوصيل: %d
de: Socket konnte nicht erstellt werden: %d
en: Failed to create socket: %d
es: Error al crear el socket: %d
fr: Échec de la création du socket : %d
ja: ソケットの作成に失敗しました: %d
ko: 소켓 생성 실패: %d
pt: Falha ao criar soquete: %d
ru: Не удалось создать сокет: %d
tr: Soket oluşturulamadı: %d
zh_hant: 創建 Socket 失敗：%d

# error.socket.listenFailed
source: 监听 Socket 失败：%d
ar: فشل الاستماع على المقبس: %d
de: Socket konnte nicht überwacht werden: %d
en: Failed to listen on socket: %d
es: Error al escuchar en el socket: %d
fr: Échec de l'écoute sur le socket : %d
ja: ソケットでリッスンできませんでした: %d
ko: 소켓 수신 실패: %d
pt: Falha ao escutar no soquete: %d
ru: Не удалось прослушать сокет: %d
tr: Soket dinleme başarısız: %d
zh_hant: 監聽 Socket 失敗：%d

# error.socket.pathTooLong
source: Socket 路径过长：%@
ar: مسار مأخذ التوصيل طويل جدًا: %@
de: Socket-Pfad ist zu lang: %@
en: Socket path is too long: %@
es: La ruta del socket es demasiado larga: %@
fr: Le chemin du socket est trop long : %@
ja: ソケット パスが長すぎます: %@
ko: 소켓 경로가 너무 깁니다: %@
pt: O caminho do soquete é muito longo: %@
ru: Путь к сокету слишком длинный: %@
tr: Soket yolu çok uzun: %@
zh_hant: Socket 路徑過長：%@

# error.socket.startFailed
source: AI 活动监听启动失败：%@
ar: فشل في بدء تشغيل مستمع نشاط الذكاء الاصطناعي: %@
de: AI-Aktivitäts-Listener konnte nicht gestartet werden: %@
en: Failed to start AI activity listener: %@
es: Error al iniciar el detector de actividad de IA: %@
fr: Échec du démarrage de l'écouteur d'activité IA : %@
ja: AI アクティビティ リスナーの開始に失敗しました: %@
ko: AI 활동 리스너 시작 실패: %@
pt: Falha ao iniciar o ouvinte de atividade de IA: %@
ru: Не удалось запустить прослушиватель активности ИИ: %@
tr: Yapay zekâ etkinlik dinleyicisi başlatılamadı: %@
zh_hant: AI 活動監聽啟動失敗：%@

# hook.status.installFailed
source: 安装失败
ar: فشل التثبيت
de: Installation fehlgeschlagen
en: Installation Failed
es: Error de instalación
fr: Échec de l'installation
ja: インストールに失敗しました
ko: 설치 실패
pt: Falha na instalação
ru: Ошибка установки
tr: Yükleme Başarısız
zh_hant: 安裝失敗

# hook.status.installed
source: 已安装
ar: تم التثبيت
de: Installiert
en: Installed
es: Instalado
fr: Installé
ja: インストール済み
ko: 설치됨
pt: Instalado
ru: Установлен
tr: Yüklü
zh_hant: 已安裝

# hook.status.listening
source: 监听中
ar: يستمع
de: Lauscht
en: Listening
es: Escuchando
fr: À l'écoute
ja: 監視中
ko: 수신 중
pt: Ouvindo
ru: Слушает
tr: Dinleniyor
zh_hant: 監聽中

# hook.status.installedWithDate
source: 已安装：%@
ar: تم التثبيت: %@
de: Installiert: %@
en: Installed: %@
es: Instalado: %@
fr: Installé : %@
ja: インストール済み: %@
ko: 설치됨: %@
pt: Instalado: %@
ru: Установлено: %@
tr: Yüklendi: %@
zh_hant: 已安裝：%@

# hook.status.notInstalled
source: 未安装
ar: غير مثبت
de: Nicht installiert
en: Not Installed
es: No instalado
fr: Non installé
ja: インストールされていません
ko: 설치되지 않음
pt: Não instalado
ru: Не установлено
tr: Yüklü Değil
zh_hant: 未安裝

# metadata.description
source: 统计输入、前台应用使用时长和 AI 编程活动
ar: تتبع الإدخال ووقت استخدام التطبيق الأمامي ونشاط ترميز الذكاء الاصطناعي.
de: Verfolgen Sie Eingaben, Nutzungsdauer der Vordergrund-App und KI-Codierungsaktivitäten.
en: Track input, foreground app usage time, and AI coding activity.
es: Seguimiento de la entrada, el tiempo de uso de la aplicación en primer plano y la actividad de codificación de IA.
fr: Suivez les entrées, la durée d'utilisation de l'application au premier plan et l'activité de codage de l'IA.
ja: 入力、フォアグラウンド アプリの使用時間、AI コーディング アクティビティを追跡します。
ko: 입력, 포그라운드 앱 사용 시간 및 AI 코딩 활동을 추적합니다.
pt: Rastreie a entrada, o tempo de uso do aplicativo em primeiro plano e a atividade de codificação de IA.
ru: Отслеживайте ввод данных, время использования приложений на переднем плане и активность ИИ-кодирования.
tr: Girdileri, ön plandaki uygulama kullanım süresini ve yapay zekâ kodlama etkinliğini izler.
zh_hant: 統計輸入、前臺應用使用時長和 AI 編程活動

# metadata.title
source: 活动统计
ar: إحصائيات النشاط
de: Aktivitätsstatistiken
en: Activity Stats
es: Estadísticas de actividad
fr: Statistiques d'activité
ja: アクティビティ統計
ko: 활동 통계
pt: Estatísticas de atividade
ru: Статистика активности
tr: Etkinlik İstatistikleri
zh_hant: 活動統計

# panel.action.trackingEnabled
source: 活动统计
ar: تتبع النشاط
de: Aktivitätsverfolgung
en: Activity Tracking
es: Seguimiento de actividad
fr: Suivi des activités
ja: アクティビティの追跡
ko: 활동 추적
pt: Rastreamento de atividades
ru: Отслеживание активности
tr: Etkinlik İzleme
zh_hant: 活動統計

# panel.action.installHooks
source: 安装或更新 AI Hook
ar: تثبيت أو تحديث AI Hooks
de: AI Hooks installieren oder aktualisieren
en: Install or Update AI Hooks
es: Instalar o actualizar AI Hooks
fr: Installer ou mettre à jour les AI Hooks
ja: AI フックのインストールまたは更新
ko: AI Hook 설치 또는 업데이트
pt: Instalar ou atualizar AI Hooks
ru: Установить или обновить AI-хуки
tr: Yapay Zekâ Hook'larını Yükle veya Güncelle
zh_hant: 安裝或更新 AI Hook

# panel.action.openInputMonitoring
source: 打开输入监控设置
ar: افتح إعدادات مراقبة الإدخال
de: Einstellungen zur Eingabeüberwachung öffnen
en: Open Input Monitoring Settings
es: Abrir configuración de monitoreo de entrada
fr: Ouvrir les paramètres de surveillance des entrées
ja: 入力モニタリング設定を開く
ko: 입력 모니터링 설정 열기
pt: Abrir configurações de monitoramento de entrada
ru: Открыть настройки мониторинга ввода
tr: Giriş İzleme Ayarlarını Aç
zh_hant: 打開輸入監控設定

# panel.action.resetToday
source: 清空今日统计
ar: مسح إحصائيات اليوم
de: Heutige Statistiken löschen
en: Clear Today's Stats
es: Borrar estadísticas de hoy
fr: Effacer les statistiques du jour
ja: 今日の統計をクリア
ko: 오늘의 통계 지우기
pt: Limpar as estatísticas de hoje
ru: Очистить сегодняшнюю статистику
tr: Bugünün İstatistiklerini Temizle
zh_hant: 清空今日統計

# panel.subtitle.aiListening
source: AI 活动监听中
ar: الاستماع إلى نشاط الذكاء الاصطناعي
de: KI-Aktivität wird überwacht
en: Listening for AI activity
es: Escuchando actividad de IA
fr: Écoute de l'activité IA
ja: AI アクティビティを監視中
ko: AI 활동 수신 중
pt: Ouvindo atividade de IA
ru: Прослушивание активности ИИ
tr: Yapay zekâ etkinliği dinleniyor
zh_hant: AI 活動監聽中

# panel.subtitle.default
source: 统计输入与 AI 编程活动
ar: تتبع نشاط الإدخال والتشفير بالذكاء الاصطناعي
de: Verfolgen Sie Eingaben und KI-Codierungsaktivitäten
en: Track input and AI coding activity
es: Seguimiento de la entrada y la actividad de codificación de IA
fr: Suivez les entrées et l'activité de codage de l'IA
ja: 入力と AI コーディング アクティビティを追跡
ko: 입력 및 AI 코딩 활동 추적
pt: Rastreie a entrada e a atividade de codificação de IA
ru: Отслеживание ввода и активности ИИ-кодирования
tr: Girdi ve yapay zekâ kodlama etkinliğini izler
zh_hant: 統計輸入與 AI 編程活動

# panel.subtitle.todayInputs
source: 今日 %@ 次输入
ar: %@ المدخلات اليوم
de: %@ gibt heute ein
en: %@ inputs today
es: %@ entradas hoy
fr: %@ entrées aujourd'hui
ja: 今日は%@ 件の入力
ko: %@ 오늘 입력
pt: %@ entradas hoje
ru: %@ ввел данные сегодня
tr: Bugün %@ girdi
zh_hant: 今日 %@ 次輸入

# settings.section.status
source: 状态
ar: الحالة
de: Status
en: Status
es: Estado
fr: État
ja: ステータス
ko: 상태
pt: Estado
ru: Состояние
tr: Durum
zh_hant: 狀態

# settings.aiHooks.button
source: 安装或更新 Hook
ar: تثبيت الخطافات أو تحديثها
de: Hooks installieren oder aktualisieren
en: Install or Update Hooks
es: Instalar o actualizar ganchos
fr: Installer ou mettre à jour les hooks
ja: フックのインストールまたは更新
ko: 후크 설치 또는 업데이트
pt: Instalar ou atualizar ganchos
ru: Установить или обновить хуки
tr: Hook'ları Yükle veya Güncelle
zh_hant: 安裝或更新 Hook

# settings.aiHooks.description
source: 记录 Claude Code、Cursor 和 Codex 的提示、工具调用与执行时长。
ar: سجل المطالبات، واستدعاءات الأداة، ووقت التنفيذ من Claude Code، وCursor، وCodex.
de: Aufforderungen, Werkzeugaufrufe und Ausführungszeit von Claude Code, Cursor und Codex aufzeichnen.
en: Record prompts, tool calls, and execution time from Claude Code, Cursor, and Codex.
es: Registrar indicaciones, llamadas de herramientas y tiempo de ejecución de Claude Code, Cursor y Codex.
fr: Enregistrez les invites, les appels d'outils et le temps d'exécution de Claude Code, Cursor et Codex.
ja: Claude Code、Cursor、Codex からのプロンプト、ツール呼び出し、実行時間を記録します。
ko: Claude Code, Cursor 및 Codex의 프롬프트, 도구 호출 및 실행 시간을 기록합니다.
pt: Registre prompts, chamadas de ferramenta e tempo de execução de Claude Code, Cursor e Codex.
ru: Записывайте подсказки, вызовы инструментов и время выполнения от Claude Code, Cursor и Codex.
tr: Claude Code, Cursor ve Codex'ten istemleri, araç çağrılarını ve yürütme sürelerini kaydeder.
zh_hant: 記錄 Claude Code、Cursor 和 Codex 的提示、工具調用與執行時長。

# settings.aiHooks.footnote
source: 点击后会写入 Claude Code、Cursor 和 Codex 的 hook 配置；AI 活动监听不需要输入监控权限。
ar: يكتب إعدادات الخطاف لـ Claude Code، Cursor، و Codex. ترسل البرامج النصية أحداث النشاط محليًا من خلال مقبس Unix.
de: Schreibt Hook-Einstellungen für Claude Code, Cursor und Codex. Skripte senden Aktivitätsereignisse lokal über einen Unix-Socket.
en: Writes hook settings for Claude Code, Cursor, and Codex. AI activity listening does not require Input Monitoring.
es: Escribe la configuración del enlace para Claude Code, Cursor y Codex. Los scripts envían eventos de actividad localmente a través de un socket Unix.
fr: Écrit les paramètres de hook pour Claude Code, Cursor et Codex. Les scripts envoient des événements d'activité localement via un socket Unix.
ja: Claude Code、Cursor、および Codex のフック設定を書き込みます。スクリプトは、Unix ソケットを通じてアクティビティ イベントをローカルに送信します。
ko: Claude Code, Cursor 및 Codex에 대한 후크 설정을 작성합니다. 스크립트는 Unix 소켓을 통해 로컬로 활동 이벤트를 보냅니다.
pt: Grava configurações de gancho para Claude Code, Cursor e Codex. Os scripts enviam eventos de atividade localmente por meio de um soquete Unix.
ru: Записывает настройки ловушки для Claude Code, Cursor и Codex. Скрипты отправляют события активности локально через сокет Unix.
tr: Claude Code, Cursor ve Codex için hook ayarlarını yazar. Yapay zekâ etkinliği dinleme, Giriş İzleme gerektirmez.
zh_hant: 點擊後會寫入 Claude Code、Cursor 和 Codex 的 hook 配置；AI 活動監聽不需要輸入監控權限。

# settings.aiHooks.title
source: AI 工具 Hook
ar: خطافات أدوات الذكاء الاصطناعي
de: KI-Tool-Hooks
en: AI Tool Hooks
es: Ganchos de herramientas de IA
fr: Crochets d'outils IA
ja: AI ツールフック
ko: AI 도구 후크
pt: Ganchos para ferramentas de IA
ru: Приемы для инструментов искусственного интеллекта
tr: Yapay Zekâ Araç Hook'ları

# settings.inputMonitoring.button
source: 打开系统设置
ar: افتح إعدادات النظام
de: Systemeinstellungen öffnen
en: Open System Settings
es: Abrir configuración del sistema
fr: Ouvrir les paramètres système
ja: システム設定を開く
ko: 시스템 설정 열기
pt: Abra as configurações do sistema
ru: Открыть настройки системы
tr: Sistem Ayarlarını Aç
zh_hant: 打開系統設定

# settings.inputMonitoring.description
source: 用于统计键盘、鼠标点击和滚动事件。
ar: يحسب أحداث لوحة المفاتيح، والنقر بالماوس، والتمرير.
de: Zählt Tastatur-, Mausklick- und Bildlaufereignisse.
en: Counts keyboard, mouse click, and scroll events.
es: Cuenta eventos de teclado, clic del mouse y desplazamiento.
fr: Compte les événements de clavier, de clic de souris et de défilement.
ja: キーボード、マウスのクリック、スクロールのイベントをカウントします。
ko: 키보드, 마우스 클릭 및 스크롤 이벤트를 계산합니다.
pt: Conta eventos de teclado, clique do mouse e rolagem.
ru: Считает события клавиатуры, щелчка мыши и прокрутки.
tr: Klavye, fare tıklaması ve kaydırma etkinliklerini sayar.
zh_hant: 用於統計鍵盤、滑鼠點擊和滾動事件。
